{
    "locale": "en",
    "title": "Skills",
    "Skills": {
        "TechnicalSkills": {
            "Front-end": [
                {
                    "title": "HTML/CSS",
                    "level": 95
                },
                {
                    "title": "JavaScript",
                    "level": 85
                },
                {
                    "title": "TypeScript",
                    "level": 60
                },
                {
                    "title": "Frontend Frameworks",
                    "description": "Competency in the popular frontend framework Svelte and expertise in SCSS. Additionally, consider acquiring skills in other frontend technologies like React.js, Vue.js, or Angular.",
                    "level": 60
                }
            ],
            "Back-end": [
                {
                    "title": "PHP",
                    "description": "Proficient in PHP for server-side web development, with expertise in building dynamic and scalable web applications.",
                    "level": 70
                },
                {
                    "title": "Node.js",
                    "description": "Highly skilled in Node.js for server-side JavaScript development, with experience in building game servers for Unity games.",
                    "level": 85
                },
                {
                    "title": "Databases",
                    "description": "Competent in database design and management with a focus on SQL (including MySQL and Microsoft SQL Server) and NoSQL databases (such as MongoDB).",
                    "level": 50
                },
                {
                    "title": "Cloud",
                    "description": "Familiar with cloud platforms such as AWS and Azure.",
                    "level": 40
                }
            ],
            "Unity": [
                {
                    "title": "C#",
                    "description": "Proficient in C# programming for Unity game development, with expertise in creating interactive gameplay and optimizing game performance.",
                    "level": 90
                },
                {
                    "title": "Game Development",
                    "description": "Skilled in developing 2D and 3D games in Unity, including gameplay mechanics, user interfaces, and game optimization.",
                    "level": 95
                },
                {
                    "title": "UI Design",
                    "description": "Proficient in designing user interfaces (UI) for Unity games, ensuring a seamless and engaging player experience.",
                    "level": 80
                },
                {
                    "title": "Unity Asset Development",
                    "description": "Experience in creating and optimizing custom Unity assets to enhance game development workflows and improve game performance.",
                    "level": 70
                },
                {
                    "title": "Multiplayer",
                    "description": "Knowledge of implementing multiplayer functionality in Unity games, enabling online and multiplayer gaming experiences.",
                    "level": 60
                }
            ],
            "Additional": [
                {
                    "title": "Version Control",
                    "description": "Proficiency in version control systems like Git and experience in collaborative software development.",
                    "level": 70
                },
                {
                    "title": "Cloud",
                    "description": "Familiarity with cloud platforms such as AWS and Azure.",
                    "level": 30
                },
                {
                    "title": "API",
                    "description": "Knowledge of designing and developing RESTful APIs for web and mobile applications.",
                    "level": 40
                },
                {
                    "title": "CMS",
                    "description": "Experience in working with content management systems like WordPress for web content management.",
                    "level": 50
                },
                {
                    "title": "Docker",
                    "description": "Experience in containerization using Docker for efficient deployment and management of applications.",
                    "level": 55
                },
                {
                    "title": "Postman",
                    "description": "Proficiency in using Postman for API testing and development, including automated testing and documentation.",
                    "level": 60
                },
                {
                    "title": "ChatGPT",
                    "description": "Proficiency in prompt programming and adept at knowledge searching using advanced language models like ChatGPT.",
                    "level": 80
                }
            ]
        },
        "Certifications": {
            "title": "Certifications",
            "data": [
                {
                    "title": "ITIL",
                    "description": "IT Infrastructure Library (ITIL) Foundation certification."
                },
                {
                    "title": "Azure Fundamentals",
                    "description": "Microsoft Azure Fundamentals certification."
                }
            ]
        },
        "Languages": {
            "title": "Languages",
            "data": [
                {
                    "title": "Swedish",
                    "description": "Native"
                },
                {
                    "title": "English",
                    "description": "Fluent"
                }
            ]
        }
    }
}